---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedItemFiles
source: html/0c62a934-d041-14d6-dc54-bd99b8a67111.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllUsedItemFiles Method

Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.

## Syntax (C#)
```csharp
public IList<FabricationItemFile> GetAllUsedItemFiles()
```

## Returns
All the used fabrication item files.